cypress-api-test/cypress/fixtures/get_declaration.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:id="http://x-road.eu/xsd/identifiers" xmlns:xrd="http://x-road.eu/xsd/xroad.xsd">
    <SOAP-ENV:Header>
        <xrd:client id:objectType="SUBSYSTEM">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>COM</id:memberClass>
            <id:memberCode>CYPRESS</id:memberCode>
            <id:subsystemCode>LOCAL</id:subsystemCode>
        </xrd:client>
        <xrd:service id:objectType="SERVICE">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>GOV</id:memberClass>
            <id:memberCode>GENES</id:memberCode>
            <id:subsystemCode>LOCAL</id:subsystemCode>
            <id:serviceCode>getDeclaration</id:serviceCode>
            <id:serviceVersion>v1</id:serviceVersion>
        </xrd:service>
        <xrd:id>$varGuid</xrd:id>
        <xrd:protocolVersion>4.0</xrd:protocolVersion>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns5:getDeclaration xmlns:ns5="http://producer.x-road.eu/genmed/2020/declaration">
            <declarationRef>$varDeclarationRef</declarationRef>
        </ns5:getDeclaration>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>